app/controllers/comments_controller.rb

    def create


        @post = Post.find(params[:post_id])



        @comment = @post.comments.create(comment_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", nil]]
INSERT INTO "comments" ("username", "body", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "Jamal"], ["body", "1111111111111"], ["post_id", 23], ["created_at", "2019-10-14 21:39:18.587540"], ["updated_at", "2019-10-14 21:39:18.587540"]]