app/controllers/posts_controller.rb

SELECT "categories".* FROM "categories"
---
    def new
        @post = Post.new
        @categories = Category.all

INSERT INTO "posts" ("title", "content", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Gaida is great to work with"], ["content", "jjhfjhfjh"], ["category_id", 3], ["created_at", "2019-10-23 15:21:02.441336"], ["updated_at", "2019-10-23 15:21:02.441336"]]
---
    def create
        @post = Post.new(post_params)
        if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 22]]
UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "There is no Mormonism in Morocco. Jamal hates Mormons. But he loves one. Now Jamal loves them. It was a fast change."], ["updated_at", "2019-10-13 20:05:36.031527"], ["id", 25]]
---
    def update
        @post = Post.find(params[:id])
        if @post.update(post_params)