app/controllers/users_controller.rb

    def create

        @user = User.new(user_params)
        if @user.save
---
INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "jon"], ["password_digest", "$2a$12$17Zuh1vs5nJNeIVUFVv5f.Z3tnZjkYpvPlT4FiD95VnPKmC1xupOa"], ["created_at", "2019-10-23 15:45:28.999441"], ["updated_at", "2019-10-23 15:45:28.999441"]]